Revit 2025 API
ExternalDataInstanceRemovedFromDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceRemovedFrom event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceRemovedFromDocumentEventArgs : RevitAPIPostDocEventArgs
Public Class ExternalDataInstanceRemovedFromDocumentEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ExternalDataInstanceRemovedFromDocumentEventArgs : public RevitAPIPostDocEventArgs
type ExternalDataInstanceRemovedFromDocumentEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ExternalDataInstanceRemovedFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPostDocEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
(Inherited from RevitAPIPostEventArgs)
TypeId |  The type id of the external data instance id that has been removed from Revit document.
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace